{
  "backend/main.mo": "Main backend actor defining user profiles, stores, products, orders, reviews, terms content, and access-control helpers with authorization and blob storage mixins.",
  "backend/migration.mo": "Migration module converting old actor state to the new user profile format and initializing empty terms content.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of frontend files for reference.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Base HTML document mounting the frontend app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app with routing, auth guards, role redirects, profile setup, PIN unlock, and terms acceptance flows.",
  "frontend/src/components/admin/TermsManagementPanel.tsx": "Admin UI panel to view and edit customer and store-owner terms, with save operations and validation.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a button that navigates users back to the home page.",
  "frontend/src/components/auth/PinSetupDialog.tsx": "Guides users through creating and confirming a 4‑digit PIN and optionally enabling biometric authentication.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Provides a multi-field form for creating a user profile and optionally bootstrapping a super admin account.",
  "frontend/src/components/auth/UnlockDialog.tsx": "Handles unlocking the app via biometrics or a 4‑digit PIN, falling back to PIN if biometric auth fails.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation links based on role, header, footer, theme toggle, and logout flow.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Manages theme state (light, dark, system) and applies resolved theme to the document root.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Provides a button to toggle between light and dark themes using ThemeProvider.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBiometricAuth.ts": "Implements enabling and verifying biometric authentication using WebAuthn with local storage state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including storing identity, login flow, and status tracking.",
  "frontend/src/hooks/useLocalPin.ts": "Implements a local PIN system using hashed storage and session-based unlock state with helpers to set, verify, lock, and unlock.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actors to fetch and mutate profiles, terms, stores, orders, and related data.",
  "frontend/src/index.css": "Tailwind base styles with extensive CSS variables for light/dark themes and UI color tokens.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing store, customer, order, and revenue stats with analytics views and store block/unblock actions.",
  "frontend/src/pages/auth/RoleLoginPage.tsx": "Login page for specific user roles using Internet Identity and redirects once authenticated.",
  "frontend/src/pages/customer/CartPage.tsx": "Customer shopping cart page displaying items grouped by store with quantity controls and navigation to checkout or shopping.",
  "frontend/src/pages/customer/CheckoutPage.tsx": "Handles checkout flow including cart display, payment method selection, PIN/biometric auth, and submitting orders.",
  "frontend/src/pages/customer/CustomerDashboard.tsx": "Displays customer dashboard with navigation cards linking to store access, search, marketplace, cart, and orders.",
  "frontend/src/pages/customer/MarketplacePage.tsx": "Shows searchable, filterable marketplace products and lets users add discounted items to the cart.",
  "frontend/src/pages/customer/OrderDetailPage.tsx": "Displays details for a specific order including items, store info, status, and special notes.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Lists user orders separated into active and completed tabs with navigation to order detail pages.",
  "frontend/src/pages/customer/StoreAccessPage.tsx": "Simple form allowing users to enter a store ID and navigate to the store’s product page.",
  "frontend/src/pages/customer/StoreDetailPage.tsx": "Shows store info, ratings, and product list, with ability to add in‑stock items to the cart.",
  "frontend/src/pages/customer/StoreSearchPage.tsx": "Displays a searchable and filterable list of stores, allowing customers to navigate to a selected store’s page.",
  "frontend/src/pages/owner/InventoryPage.tsx": "Provides product management for a store, including creating, editing, deleting, and viewing low-stock items.",
  "frontend/src/pages/owner/OrdersManagementPage.tsx": "Shows store orders grouped by status and allows owners to update order progress.",
  "frontend/src/pages/owner/OwnerDashboard.tsx": "Lists the owner's stores and provides navigation to store inventory, orders, settings, and registration.",
  "frontend/src/pages/owner/StoreRegistrationPage.tsx": "Form interface for owners to register a new store with basic details.",
  "frontend/src/pages/owner/StoreSettingsPage.tsx": "Allows owners to view and update existing store details such as name, category, and location.",
  "frontend/src/pages/terms/TermsAcceptancePage.tsx": "Displays terms content, lets users confirm acceptance, and submits acceptance before redirecting based on role.",
  "frontend/src/state/cartStore.ts": "Zustand store managing cart items per store with add, remove, update, clear, and total‑calculation helpers.",
  "frontend/src/utils/analytics.ts": "Provides functions to aggregate orders into daily, weekly, and monthly revenue and count statistics.",
  "frontend/src/utils/money.ts": "Utilities for formatting prices and calculating effective and line‑item totals with discounts.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from URL/hash.",
  "frontend/src/utils/userProfile.ts": "Generates display names and initials from a user profile object.",
  "frontend/src/utils/webauthn.ts": "WebAuthn utilities for availability checks and creating or retrieving authentication credentials.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing PrimePost’s architecture, features, and requirements."
}