{
  "backend/main.mo": "Main Motoko canister defining user profiles, roles, stores, products, orders, reviews, and terms with authorization helpers and in‑memory storage maps.",
  "feature_evidence.json": "JSON feature evidence report describing a requirement to ensure the APK binary is correctly served and installed, listing related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files including routing, hooks, components, pages, and utilities for the PrimePost app.",
  "frontend/.gitattributes": "Configures Git to treat APKs and other binary assets as binary to avoid corruption.",
  "frontend/android/.gitignore": "Gitignore for Android project build outputs, generated files, IDE metadata, and keystores.",
  "frontend/android/app/build.gradle": "Android module build script configuring SDK versions, dependencies, asset copying, and build types.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest defining app permissions, main activity, and deep link intent filters.",
  "frontend/android/app/src/main/assets/www/.keep": "Empty placeholder file ensuring the assets directory is preserved in Git.",
  "frontend/android/app/src/main/java/com/primepost/app/MainActivity.kt": "Main Android activity hosting the WebView, handling navigation, deep links, and Internet Identity auth flows.",
  "frontend/android/app/src/main/java/com/primepost/app/WebViewAuthNavigator.kt": "Helper class deciding when to open URLs externally and handling deep link return logic for auth.",
  "frontend/android/app/src/main/res/drawable/splash_screen.xml": "Splash screen drawable showing a white background with centered launcher icon.",
  "frontend/android/app/src/main/res/layout/activity_main.xml": "Layout containing a full‑screen WebView for rendering the embedded web app.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon definition similar to the standard one.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon definition with white background and foreground graphic.",
  "frontend/android/app/src/main/res/values/strings.xml": "Defines the app name string resource.",
  "frontend/android/app/src/main/res/values/themes.xml": "Defines the app theme with splash screen and no action bar.",
  "frontend/android/build.gradle": "Top‑level Gradle build script configuring repositories and plugin versions for the Android project.",
  "frontend/android/gradle.properties": "Gradle configuration flags including JVM args and AndroidX settings.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Specifies Gradle wrapper distribution settings using Gradle 8.2.",
  "frontend/android/settings.gradle": "Gradle settings declaring repositories and including the app module.",
  "frontend/docs/android-apk-build.md": "Documentation explaining prerequisites and steps for building the PrimePost Android APK.",
  "frontend/index.css": "Empty CSS file placeholder for global styles.",
  "frontend/index.html": "Root HTML file loading the React app entry point.",
  "frontend/scripts/build-android-apk-debug.ps1": "Builds the React web app and Android debug APK on Windows, verifies the APK, and copies it to public assets.",
  "frontend/scripts/build-android-apk-debug.sh": "Builds the React web app and Android debug APK on Unix systems, validates the APK, and publishes it with metadata.",
  "frontend/scripts/stage-android-apk-assets.ps1": "Stages the APK and metadata on Windows by validating existing assets or triggering a rebuild, then performs final checks.",
  "frontend/scripts/stage-android-apk-assets.sh": "Stages the APK and metadata on Unix systems, rebuilding if needed and verifying size, signature, and metadata.",
  "frontend/src/App.tsx": "Defines the root React app, routing structure, and authentication flows including PIN, biometric, and profile setup dialogs.",
  "frontend/src/components/admin/TermsManagementPanel.tsx": "Admin UI for viewing, editing, and publishing legal documents such as terms and privacy policy, with save and publish actions.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a button to return home.",
  "frontend/src/components/auth/BiometricEnablementDialog.tsx": "Dialog for enabling biometric authentication with setup, skip, and error handling.",
  "frontend/src/components/auth/PinSetupDialog.tsx": "Handles creation and confirmation of a 4‑digit PIN using a two‑step dialog.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Form dialog for creating a user profile with validation, role handling, and save mutations.",
  "frontend/src/components/auth/UnlockDialog.tsx": "Unlock flow supporting biometric authentication fallback to PIN input with error handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with role‑based navigation, header, footer, and logout handling.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Provides theme context, persists theme selection, and syncs resolved light/dark mode.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button to toggle between light and dark themes using ThemeProvider.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity change.",
  "frontend/src/hooks/useAndroidAuthBridge.ts": "Detects Android WebView and wraps Internet Identity login with Android‑specific error handling.",
  "frontend/src/hooks/useBiometricAuth.ts": "Manages WebAuthn-based biometric enabling and verification with local credential storage and processing state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login flow, stored identity loading, and AuthClient configuration.",
  "frontend/src/hooks/useLocalPin.ts": "Implements local PIN hashing, storage, verification, and session unlock state using a reactive store.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods like profiles, terms, and admin actions.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/legal/providedLegalText.ts": "Contains bundled customer and store‑owner legal documents for PrimePost as static text exports.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing platform stats, store block/unblock controls, and order analytics with daily, weekly, and monthly views.",
  "frontend/src/pages/auth/RoleLoginPage.tsx": "Role-based login page handling Internet Identity or Android bridge auth and redirecting users to the correct dashboard.",
  "frontend/src/pages/customer/CartPage.tsx": "Customer cart UI for reviewing items, adjusting quantities, removing products, and navigating to checkout or stores.",
  "frontend/src/pages/customer/CheckoutPage.tsx": "Checkout flow allowing table input, notes, payment selection, PIN/biometric auth, and order placement.",
  "frontend/src/pages/customer/CustomerDashboard.tsx": "Customer home dashboard offering navigation to store access, search, marketplace, cart, and order history.",
  "frontend/src/pages/customer/MarketplacePage.tsx": "Marketplace listing with search, filters, sorting, and add-to-cart functionality for discounted products.",
  "frontend/src/pages/customer/OrderDetailPage.tsx": "Displays details for a specific customer order, including items, store info, status, and optional notes, with navigation back to orders.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Shows a tabbed list of active and completed customer orders with status badges and navigation to individual order details.",
  "frontend/src/pages/customer/StoreAccessPage.tsx": "Provides a form for entering a store ID and navigating to that store’s page.",
  "frontend/src/pages/customer/StoreDetailPage.tsx": "Loads and displays store info, products, and reviews, allowing customers to add items to cart or navigate back.",
  "frontend/src/pages/customer/StoreSearchPage.tsx": "Enables searching and filtering stores by name and category, showing matching results with navigation links.",
  "frontend/src/pages/owner/InventoryPage.tsx": "Allows store owners to manage products, including creating, editing, and deleting items with image uploads and stock controls.",
  "frontend/src/pages/owner/OrdersManagementPage.tsx": "Displays store orders grouped by status and lets owners update each order's status.",
  "frontend/src/pages/owner/OwnerDashboard.tsx": "Shows the owner's stores and provides navigation to register stores, manage inventory, view orders, and adjust settings.",
  "frontend/src/pages/owner/StoreRegistrationPage.tsx": "Provides a form to register a new store and submit details to the backend.",
  "frontend/src/pages/owner/StoreSettingsPage.tsx": "Loads an existing store's data and allows editing and saving updated store information.",
  "frontend/src/pages/public/ApkDownloadPage.tsx": "Fetches APK metadata, validates the deployed APK, and displays download info or errors.",
  "frontend/src/pages/terms/PrivacyPolicyPage.tsx": "Loads and displays the privacy policy content with a scrollable view and fallback if unavailable.",
  "frontend/src/pages/terms/TermsAcceptancePage.tsx": "Renders a terms acceptance page that loads terms content, falls back to bundled text, and submits acceptance before redirecting.",
  "frontend/src/state/cartStore.ts": "Zustand store managing per‑store carts with add, remove, update, clear, and total‑calculation logic.",
  "frontend/src/state/pinSessionStore.ts": "In‑tab reactive store tracking whether a PIN is set and whether the session is unlocked, syncing with local and session storage.",
  "frontend/src/utils/analytics.ts": "Provides helpers to aggregate orders into daily, weekly, and monthly revenue and count statistics.",
  "frontend/src/utils/apkIntegrity.ts": "Fetches and validates APK metadata and binary integrity, checking size, content type, and ZIP header.",
  "frontend/src/utils/money.ts": "Utility functions for formatting prices and computing discounted and line‑item totals using bigint.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL parameters across navigation and hash routes.",
  "frontend/src/utils/userProfile.ts": "Generates display names and initials from a user profile with simple fallbacks.",
  "frontend/src/utils/webauthn.ts": "Provides WebAuthn availability checks and wrappers for creating and retrieving platform authenticator credentials.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content scanning, extended colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state, architecture notes, known issues, and existing features for the PrimePost multi‑vendor POS platform."
}