{
  "backend/main.mo": "Primary Motoko canister defining user roles, profiles, stores, products, orders, reviews, and auth/storage mixins with role checks and state maps.",
  "backend/migration.mo": "Migration module converting old actor state to new format by adding userId and nextUserId while preserving other fields.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files describing their purpose and key behaviors.",
  "frontend/.gitattributes": "Marks various binary file types as binary to avoid Git corruption and diffing issues.",
  "frontend/android/.gitignore": "Git ignore rules for Android build outputs, IDE files, and generated assets.",
  "frontend/android/app/build.gradle": "Android Gradle config setting app metadata, build settings, dependencies, and a task to copy web assets into the app.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest defining app permissions, main activity, launcher settings, and deep link intent filters for auth.",
  "frontend/android/app/src/main/assets/www/.keep": "Placeholder file ensuring the assets directory is committed.",
  "frontend/android/app/src/main/java/com/primepost/app/MainActivity.kt": "Android activity hosting a WebView with custom auth handling, deep link support, and local web asset loading.",
  "frontend/android/app/src/main/java/com/primepost/app/WebViewAuthNavigator.kt": "Handles deciding when to open URLs externally, detecting app return deep links, and launching Chrome Custom Tabs with fallback.",
  "frontend/android/app/src/main/res/drawable/splash_screen.xml": "Defines a white splash screen with the app launcher icon centered.",
  "frontend/android/app/src/main/res/layout/activity_main.xml": "Layout containing a full‑screen WebView used by the Android app.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon using the same background and foreground assets.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon specifying white background and foreground asset.",
  "frontend/android/app/src/main/res/values/strings.xml": "Defines the app name string resource.",
  "frontend/android/app/src/main/res/values/themes.xml": "App theme configuring a splash screen background and disabling title/action bar.",
  "frontend/android/build.gradle": "Top‑level Gradle build configuration including Kotlin and Android Gradle plugins.",
  "frontend/android/gradle.properties": "Gradle settings enabling AndroidX, JVM args, and Kotlin code style.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Configures the Gradle wrapper to use Gradle 8.2.",
  "frontend/android/settings.gradle": "Defines repositories, project name, and includes the app module.",
  "frontend/docs/android-apk-build.md": "Documentation on prerequisites and steps for building the Android APK.",
  "frontend/index.css": "Empty stylesheet placeholder for the web frontend.",
  "frontend/index.html": "HTML entrypoint loading the React application root and main script.",
  "frontend/scripts/build-android-apk-debug.ps1": "PowerShell script building the web app, assembling a debug APK, validating it, and publishing it to assets.",
  "frontend/scripts/build-android-apk-debug.sh": "Shell script performing web build, debug APK creation, integrity checks, and asset publishing.",
  "frontend/scripts/stage-android-apk-assets.ps1": "PowerShell script verifying or building the APK, then ensuring APK and metadata are staged for deployment.",
  "frontend/scripts/stage-android-apk-assets.sh": "Shell script that checks for an existing APK, builds if needed, then validates and stages APK and metadata.",
  "frontend/src/App.tsx": "Sets up routing, authentication state checks, and conditional dialogs for profile setup, PIN, unlock, and biometrics.",
  "frontend/src/components/admin/TermsManagementPanel.tsx": "Provides an admin interface to view, edit, and publish legal documents including terms and privacy policy.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied page with navigation and logout options, tailored for admin and non-admin routes.",
  "frontend/src/components/auth/BiometricEnablementDialog.tsx": "Shows a dialog for enabling biometric authentication, handling setup, cancellation, and errors.",
  "frontend/src/components/auth/FactoryResetDialog.tsx": "Prompts users to confirm a full application reset by typing a phrase and handles validation and errors.",
  "frontend/src/components/auth/PinSetupDialog.tsx": "Guides users through creating and confirming a 4‑digit PIN, with validation and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Form dialog for creating a user profile, handling validation, role selection, super-admin bootstrapping, and saving data via mutations.",
  "frontend/src/components/auth/UnlockDialog.tsx": "Unlock screen supporting biometric authentication and PIN fallback with error handling and automatic biometric attempts.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout providing navigation, language selection, theming, and logout handling based on user role.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Context provider managing theme state, syncing it to localStorage, and resolving system or explicit light/dark modes.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button component that toggles the current theme between light and dark.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useAndroidAuthBridge.ts": "Detects Android WebView and wraps login with Android-specific handling and error messaging.",
  "frontend/src/hooks/useBiometricAuth.ts": "Manages enabling and verifying WebAuthn-based biometric authentication with storage of credential IDs and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks to manage Internet Identity authentication using AuthClient, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useLocalPin.ts": "Implements PIN storage and verification using hashed localStorage values with session-based unlock state managed through a reactive store.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query hooks for user profiles, admin bootstrap flows, terms content, and factory reset operations.",
  "frontend/src/i18n/LanguageProvider.tsx": "Defines a language context with English/French translations, persists language selection, and exposes a translation function.",
  "frontend/src/i18n/translations/en.ts": "English translation dictionary containing UI strings for common actions, navigation, dashboards, and forms.",
  "frontend/src/i18n/translations/fr.ts": "French translation dictionary mirroring the English keys for UI text and application flows.",
  "frontend/src/index.css": "Tailwind base styles with CSS variables defining color themes for light and dark modes and shared layout tokens.",
  "frontend/src/legal/providedLegalText.ts": "Exports static customer and store-owner legal terms strings for PrimePost.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing store, customer, order stats, revenue, analytics, and store block/unblock controls.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin settings page displaying a panel to manage legal terms and privacy policies.",
  "frontend/src/pages/auth/RoleLoginPage.tsx": "Handles role-based login, super-admin bootstrap flow, Android auth bridge, and factory reset actions.",
  "frontend/src/pages/customer/CartPage.tsx": "Shows cart items grouped by store with quantity controls, totals, and navigation to checkout or stores.",
  "frontend/src/pages/customer/CheckoutPage.tsx": "Manages checkout flow including order submission, payment method selection, biometrics or PIN verification.",
  "frontend/src/pages/customer/CustomerDashboard.tsx": "Displays a customer dashboard with navigational action cards linking to store access, search, marketplace, cart, and orders.",
  "frontend/src/pages/customer/CustomerSettingsPage.tsx": "Loads and edits the user's profile, allowing updates to name, phone, and email with save and loading states.",
  "frontend/src/pages/customer/MarketplacePage.tsx": "Shows marketplace products with search, category filter, sorting, and add‑to‑cart functionality.",
  "frontend/src/pages/customer/OrderDetailPage.tsx": "Displays detailed information for a selected order including items, status, store info, and payment details.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Lists the user's active and completed orders with tabs and navigation to order details.",
  "frontend/src/pages/customer/StoreAccessPage.tsx": "Allows users to enter a store ID and navigate to that store’s page.",
  "frontend/src/pages/customer/StoreDetailPage.tsx": "Shows store details, ratings, and product list with add‑to‑cart support and handling for loading or missing stores.",
  "frontend/src/pages/customer/StoreSearchPage.tsx": "Lists all stores with search and category filtering and navigates to selected store pages.",
  "frontend/src/pages/owner/InventoryPage.tsx": "Manages store products with create, edit, delete, and image upload inside a dialog form.",
  "frontend/src/pages/owner/OrdersManagementPage.tsx": "Displays store orders grouped by status and allows updating each order’s status.",
  "frontend/src/pages/owner/OwnerDashboard.tsx": "Shows owner’s stores with navigation to inventory, orders, and settings and allows registering new stores.",
  "frontend/src/pages/owner/OwnerSettingsPage.tsx": "Allows owners to view and edit their profile information with validation and save actions.",
  "frontend/src/pages/owner/StoreRegistrationPage.tsx": "Provides a form to create a new store with name, category, location, and mobile money details.",
  "frontend/src/pages/owner/StoreSettingsPage.tsx": "Store settings page that loads store data, lets owners edit fields, and submits updates via mutation.",
  "frontend/src/pages/public/ApkDownloadPage.tsx": "Public page that fetches APK metadata, validates the deployed APK, and shows download or error states.",
  "frontend/src/pages/terms/PrivacyPolicyPage.tsx": "Loads and displays the privacy policy content with fallback UI when unavailable.",
  "frontend/src/pages/terms/TermsAcceptancePage.tsx": "Displays terms content, allows users to accept it, and records acceptance before redirecting.",
  "frontend/src/state/cartStore.ts": "Zustand store managing per‑store shopping carts with add, remove, update, and total‑calculation logic.",
  "frontend/src/state/pinSessionStore.ts": "In‑tab reactive store tracking PIN setup and unlock state using memory plus browser storage.",
  "frontend/src/utils/analytics.ts": "Utility functions aggregating order data into daily, weekly, and monthly revenue statistics.",
  "frontend/src/utils/apkIntegrity.ts": "Fetches and validates APK metadata and deployed APK headers to detect incorrect or HTML responses.",
  "frontend/src/utils/geolocation.ts": "Provides geolocation access, distance calculation, and parsing of coordinate strings.",
  "frontend/src/utils/logout.ts": "Implements centralized logout and factory-reset cleanup, clearing identity, caches, storage, and navigation state.",
  "frontend/src/utils/money.ts": "Formats prices and computes effective prices and line totals using bigint arithmetic.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/userProfile.ts": "Generates display names and initials from a UserProfile object.",
  "frontend/src/utils/webauthn.ts": "Provides WebAuthn availability checks and helpers for creating and retrieving credentials.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s state, architecture, requirements, and existing features for a bilingual Flutter-based POS/marketplace app. Contains role definitions, sequential ID rules, security requirements, and tracked implemented features."
}