{
  "backend/main.mo": "Defines the main canister with user, store, product, order, review, and terms data structures plus authorization mixins and helper role-checking functions.",
  "feature_evidence.json": "Feature evidence report listing APK delivery requirements, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-style mapping of frontend file paths to short functional summaries for each component or utility.",
  "frontend/.gitattributes": "Configures Git attributes to treat APKs and other binaries correctly and enforce LF endings for meta JSON files.",
  "frontend/android/.gitignore": "Gitignore rules for Android build outputs, IDE files, keystores, and generated asset directories.",
  "frontend/android/app/build.gradle": "Gradle config for the Android app, including SDK settings, dependencies, build types, and a task to copy web assets into the app.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Defines app permissions, main activity, launcher intent, and deep link handling for auth return.",
  "frontend/android/app/src/main/assets/www/.keep": "Empty placeholder file ensuring the assets directory is tracked in Git.",
  "frontend/android/app/src/main/java/com/primepost/app/MainActivity.kt": "Android WebView host activity loading the web app, handling deep links, and routing auth flows through external custom tabs.",
  "frontend/android/app/src/main/java/com/primepost/app/WebViewAuthNavigator.kt": "Utility class determining when to open URLs externally and managing return-to-app deep links via custom tabs.",
  "frontend/android/app/src/main/res/drawable/splash_screen.xml": "Defines a splash screen layer-list with a white background and centered launcher icon.",
  "frontend/android/app/src/main/res/layout/activity_main.xml": "Layout containing a full-screen WebView widget.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Adaptive round launcher icon definition mirroring the standard icon assets.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon definition with white background and foreground asset.",
  "frontend/android/app/src/main/res/values/strings.xml": "Declares the application's string resources, including app name.",
  "frontend/android/app/src/main/res/values/themes.xml": "Defines the app theme using a splash screen background and no action bar.",
  "frontend/android/build.gradle": "Top-level Gradle build configuration setting up plugin versions, repositories, and a clean task.",
  "frontend/android/gradle.properties": "Gradle properties configuring JVM args, AndroidX usage, and Kotlin style.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Specifies the Gradle wrapper distribution URL and storage paths.",
  "frontend/android/settings.gradle": "Configures plugin repositories, dependency resolution, and includes the app module.",
  "frontend/docs/android-apk-build.md": "Documentation outlining steps for building, staging, validating, and deploying the Android APK.",
  "frontend/index.css": "Empty CSS file reserved for global frontend styles.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx into the root div.",
  "frontend/public/_headers": "Defines correct content types and caching for APK and metadata files.",
  "frontend/public/_redirects": "Ensures APK and metadata are served directly and enables SPA fallback for other routes.",
  "frontend/scripts/build-android-apk-debug.ps1": "PowerShell script that builds the web app, compiles a debug Android APK, validates it, and publishes it to public assets.",
  "frontend/scripts/build-android-apk-debug.sh": "Shell script that builds the web app, generates a debug APK, validates it, and copies it to public assets with metadata.",
  "frontend/scripts/predeploy-stage-apk-assets.sh": "Wrapper script that runs platform-appropriate APK staging and blocks deployment if validation fails.",
  "frontend/scripts/stage-android-apk-assets.ps1": "PowerShell script validating or copying the debug APK to public assets and generating matching metadata.",
  "frontend/scripts/stage-android-apk-assets.sh": "Shell script ensuring the APK exists, is valid, copied to public assets, and accompanied by correct metadata.",
  "frontend/src/App.tsx": "Main React app routing and layout logic, handling authentication state, dialogs, and role-based pages.",
  "frontend/src/components/admin/TermsManagementPanel.tsx": "UI panel for admins to view, edit, and publish legal documents including customer terms, store owner terms, and privacy policy.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access-denied message with options to log in as admin, return home, or sign out when a user lacks required permissions.",
  "frontend/src/components/auth/BiometricEnablementDialog.tsx": "Dialog allowing users to enable biometric authentication, handling setup, cancellation, and error feedback.",
  "frontend/src/components/auth/FactoryResetDialog.tsx": "Confirmation dialog for performing a factory reset that deletes all application data after typing a required phrase.",
  "frontend/src/components/auth/PinSetupDialog.tsx": "Dialog for setting and confirming a 4‑digit PIN, validating input and saving it locally.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for collecting user profile details, role selection, and terms acceptance, with special handling for super admin bootstrapping.",
  "frontend/src/components/auth/UnlockDialog.tsx": "Unlock dialog using biometrics or PIN, handling errors, retries, and UI state transitions.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with navigation links based on user role, language selection, and logout handling.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Provides theme context, persists theme preference, and resolves system vs user-selected mode.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button to toggle between light and dark themes using ThemeProvider.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances based on Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useAndroidAuthBridge.ts": "Handles Android WebView login flow detection, wrapping Internet Identity login with Android-specific error handling.",
  "frontend/src/hooks/useBiometricAuth.ts": "Manages WebAuthn-based biometric enablement and verification with local credential storage and state tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, logout, and identity persistence logic.",
  "frontend/src/hooks/useLocalPin.ts": "Manages PIN hashing, storage, verification, and unlock state using local/session storage and a reactive store.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile, admin bootstrap state, terms content, and factory reset via backend actor.",
  "frontend/src/i18n/LanguageProvider.tsx": "Provides language context, persistent language selection, and a translation lookup function for English and French.",
  "frontend/src/i18n/translations/en.ts": "Contains the full set of English UI translation strings for the app.",
  "frontend/src/i18n/translations/fr.ts": "Contains the full set of French UI translation strings for the app.",
  "frontend/src/index.css": "Tailwind CSS config defining base styles, theme variables, and dark mode color tokens.",
  "frontend/src/legal/providedLegalText.ts": "Exports static legal text strings for customer and store owner terms formatted for display.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing stats, store management, and analytics aggregated daily, weekly, or monthly.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Admin settings page providing access to manage terms and policies using the TermsManagementPanel.",
  "frontend/src/pages/auth/RoleLoginPage.tsx": "Handles role‑based login, admin bootstrap flows, Android bridge auth, and factory reset logic with navigation.",
  "frontend/src/pages/customer/CartPage.tsx": "Displays cart items per store with quantity updates, removal, totals, and navigation to checkout or store pages.",
  "frontend/src/pages/customer/CheckoutPage.tsx": "Checkout flow handling order submission, payment method selection, PIN/biometric auth, and cart clearing.",
  "frontend/src/pages/customer/CustomerDashboard.tsx": "Customer dashboard offering navigation shortcuts to store access, search, marketplace, cart, and orders.",
  "frontend/src/pages/customer/CustomerSettingsPage.tsx": "Customer settings page for viewing and updating profile details with validation and save mutations.",
  "frontend/src/pages/customer/MarketplacePage.tsx": "Marketplace with product search, category filtering, sorting, and add-to-cart logic using store and product queries.",
  "frontend/src/pages/customer/OrderDetailPage.tsx": "Displays detailed info for a specific order, including items, status, store info, and navigation back to orders.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Lists active and completed orders with status badges and navigation to individual order details.",
  "frontend/src/pages/customer/StoreAccessPage.tsx": "Simple form allowing users to enter a store ID and navigate to that store’s page.",
  "frontend/src/pages/customer/StoreDetailPage.tsx": "Shows store details, reviews, and products with add-to-cart functionality and availability checks.",
  "frontend/src/pages/customer/StoreSearchPage.tsx": "Store search interface with name and category filters and navigation to selected store pages.",
  "frontend/src/pages/owner/InventoryPage.tsx": "Manages store inventory, allowing owners to create, edit, and delete products with form handling, image upload, and stock tracking.",
  "frontend/src/pages/owner/OrdersManagementPage.tsx": "Displays store orders grouped by status and lets owners update order progress through simple action buttons.",
  "frontend/src/pages/owner/OwnerDashboard.tsx": "Shows the owner's stores with quick navigation to inventory, orders, and settings, and provides store registration access.",
  "frontend/src/pages/owner/OwnerSettingsPage.tsx": "Allows owners to view and update their profile information with validation and save operations.",
  "frontend/src/pages/owner/StoreRegistrationPage.tsx": "Provides a form for creating a new store with fields for name, category, location, and mobile money number.",
  "frontend/src/pages/owner/StoreSettingsPage.tsx": "Enables editing an existing store’s details and saving updates, with loading and error handling.",
  "frontend/src/pages/public/ApkDownloadPage.tsx": "Displays APK download info, fetches metadata and validation results, and shows errors for invalid or missing APKs.",
  "frontend/src/pages/terms/PrivacyPolicyPage.tsx": "Fetches and displays the privacy policy content with a scrollable layout and fallback error alert.",
  "frontend/src/pages/terms/TermsAcceptancePage.tsx": "Shows terms content from backend or fallback text, requires user acceptance, and records acceptance via mutation.",
  "frontend/src/state/cartStore.ts": "Zustand store managing cart items per store with persistence, quantity updates, removals, and total calculations.",
  "frontend/src/state/pinSessionStore.ts": "In-memory PIN session store tracking pin-set and unlock state with subscription support.",
  "frontend/src/utils/analytics.ts": "Provides functions to aggregate orders into daily, weekly, and monthly stats with revenue totals.",
  "frontend/src/utils/apkIntegrity.ts": "Fetches APK metadata and validates APK integrity by checking headers, content type, size, and possible errors.",
  "frontend/src/utils/geolocation.ts": "Utility functions for requesting geolocation, calculating distances, and parsing coordinate strings.",
  "frontend/src/utils/logout.ts": "Provides centralized logout and factory-reset cleanup functions that clear identity, caches, storage, and navigate home, plus utilities for tracking a logout epoch.",
  "frontend/src/utils/money.ts": "Utility functions for formatting prices and computing effective prices and line totals using bigint.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/userProfile.ts": "Generates display names and initials from a UserProfile object with simple fallbacks.",
  "frontend/src/utils/webauthn.ts": "Provides WebAuthn availability checks and wrappers for creating and retrieving platform authenticator credentials with error handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, layouts, animations, and plugins for the frontend.",
  "project_state.json": "Project state metadata describing requirements, known issues, and APK deployment-related features."
}