{
  "backend/main.mo": "Main actor defining user roles, profiles, stores, products, orders, reviews, terms content, and authorization helpers, integrating mixins for access control and blob storage.",
  "backend/migration.mo": "Migration module adding a new privacyPolicy terms type and returning an empty upgraded termsContent map.",
  "feature_evidence.json": "Feature evidence report describing implemented legal text publishing, privacy policy UI, and admin editing features with associated files and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files covering routing, UI components, hooks, pages, and utilities.",
  "frontend/index.css": "Empty or placeholder CSS file for global styles.",
  "frontend/index.html": "HTML entry point loading the React app with a root div and main.tsx script.",
  "frontend/src/App.tsx": "Main React router setup managing authentication, profile setup, PIN/biometric flows, and routing including the privacy policy page.",
  "frontend/src/components/admin/TermsManagementPanel.tsx": "Admin panel for viewing, editing, and publishing customer terms, store owner terms, and privacy policy content.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Component showing an access denied message with a button to return home.",
  "frontend/src/components/auth/BiometricEnablementDialog.tsx": "Dialog for enabling biometric authentication, handling setup flow and errors with UI buttons.",
  "frontend/src/components/auth/PinSetupDialog.tsx": "Dialog guiding users through creating and confirming a 4‑digit PIN and saving it locally.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Profile creation form collecting user details, role selection, and submitting via mutations.",
  "frontend/src/components/auth/UnlockDialog.tsx": "Unlock dialog that attempts biometric auth first, falling back to PIN verification.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with navigation links by role, header, mobile menu, and logout handling.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Context provider managing theme state, persistence, and resolving system theme preference.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button toggling between light and dark themes using ThemeProvider state.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching a backend actor based on identity and invalidating dependent queries.",
  "frontend/src/hooks/useBiometricAuth.ts": "Implements WebAuthn-based biometric enablement and verification with local credential storage and processing state handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication using Dfinity AuthClient, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useLocalPin.ts": "Implements a local PIN system with simple hashing, unlock session management, and state syncing via storage events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods such as user profiles, stores, terms, and other domain operations.",
  "frontend/src/index.css": "Sets up Tailwind CSS with custom light/dark theme variables and base styling.",
  "frontend/src/legal/providedLegalText.ts": "Contains static legal text strings for customer and store-owner terms used in the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Dashboard displaying counts for stores, customers, orders, revenue, and analytics with controls to block or unblock stores.",
  "frontend/src/pages/auth/RoleLoginPage.tsx": "Role-based login page using Internet Identity that redirects authenticated users to their respective dashboards.",
  "frontend/src/pages/customer/CartPage.tsx": "Customer cart interface allowing quantity changes, item removal, and navigation back to stores or checkout.",
  "frontend/src/pages/customer/CheckoutPage.tsx": "Checkout flow that collects order details, handles biometrics or PIN confirmation, and submits orders to the backend.",
  "frontend/src/pages/customer/CustomerDashboard.tsx": "Customer dashboard offering quick navigation to store access, search, marketplace, cart, and order history.",
  "frontend/src/pages/customer/MarketplacePage.tsx": "Marketplace listing products with search, category filtering, sorting, and the ability to add items to the cart.",
  "frontend/src/pages/customer/OrderDetailPage.tsx": "Displays details of a specific customer order, including items, store info, status badge, and navigation back to order list.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Lists a user's active and completed orders with status badges and navigation to individual order details.",
  "frontend/src/pages/customer/StoreAccessPage.tsx": "Provides a form for entering a store ID and navigating to that store's detail page.",
  "frontend/src/pages/customer/StoreDetailPage.tsx": "Shows store information, products, reviews, and allows adding items to the cart with availability checks.",
  "frontend/src/pages/customer/StoreSearchPage.tsx": "Allows users to search and filter stores by name and category, displaying results with navigation to each store.",
  "frontend/src/pages/owner/InventoryPage.tsx": "Enables store owners to view, create, edit, and delete products with image uploads, stock management, and mutation handling.",
  "frontend/src/pages/owner/OrdersManagementPage.tsx": "Displays and manages store orders with status updates and categorized views.",
  "frontend/src/pages/owner/OwnerDashboard.tsx": "Shows the store owner's dashboard with store listings and navigation options.",
  "frontend/src/pages/owner/StoreRegistrationPage.tsx": "Provides a form for registering a new store and submitting its details.",
  "frontend/src/pages/owner/StoreSettingsPage.tsx": "Allows editing and updating an existing store's information.",
  "frontend/src/pages/terms/PrivacyPolicyPage.tsx": "Fetches and displays the privacy policy content with a scrollable view.",
  "frontend/src/pages/terms/TermsAcceptancePage.tsx": "Displays terms content and handles user acceptance before redirecting.",
  "frontend/src/state/cartStore.ts": "Zustand store managing cart items by store with add, remove, update, clear, and total calculation logic, persisted under 'primepost-cart'.",
  "frontend/src/utils/analytics.ts": "Provides functions to aggregate orders into daily, weekly, and monthly revenue and count statistics.",
  "frontend/src/utils/money.ts": "Utility functions for formatting prices and computing effective and line totals with optional discounts.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/userProfile.ts": "Functions to derive a display name and initials from a user profile.",
  "frontend/src/utils/webauthn.ts": "WebAuthn helpers to check availability and create or retrieve platform credentials with proper error handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing PrimePost’s architecture, requirements, existing features, and known issues."
}