{
  "backend/main.mo": "Motoko canister defining user profiles, roles, stores, products, orders, reviews, and terms with authorization and blob‑storage mixins plus helpers for role and ownership checks.",
  "feature_evidence.json": "Feature report documenting a requirement to wrap the React tree in LanguageProvider, including related files, components, tests, and confidence rating.",
  "frontend-file-summaries.txt": "JSON-like list containing prewritten summaries for many frontend files including components, pages, hooks, and utilities.",
  "frontend/.gitattributes": "Configures Git attributes to treat various binary file types as binary to avoid corruption.",
  "frontend/android/.gitignore": "Gitignore rules for Android project build artifacts, IDE files, and generated assets.",
  "frontend/android/app/build.gradle": "Android app Gradle config setting SDK versions, dependencies, build types, and a task copying web assets into the app.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest declaring permissions, main activity, launcher intent, and deep link handling for authentication.",
  "frontend/android/app/src/main/assets/www/.keep": "Placeholder file ensuring the assets directory is preserved in version control.",
  "frontend/android/app/src/main/java/com/primepost/app/MainActivity.kt": "Main Android activity hosting a WebView with custom auth navigation, deep link handling, and web app loading.",
  "frontend/android/app/src/main/java/com/primepost/app/WebViewAuthNavigator.kt": "Helper class controlling external auth domain handling, deep link detection, and opening URLs in custom tabs.",
  "frontend/android/app/src/main/res/drawable/splash_screen.xml": "Splash screen drawable showing a white background with centered launcher icon.",
  "frontend/android/app/src/main/res/layout/activity_main.xml": "Layout defining a full‑screen FrameLayout containing a WebView.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive icon definition mirroring the standard launcher icon setup.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive icon definition with white background and foreground layer.",
  "frontend/android/app/src/main/res/values/strings.xml": "Resource file defining the app name string.",
  "frontend/android/app/src/main/res/values/themes.xml": "App theme configuration specifying splash screen and disabling action bar and overlays.",
  "frontend/android/build.gradle": "Top‑level Gradle build configuration with plugin versions, repositories, and a clean task.",
  "frontend/android/gradle.properties": "Gradle settings for JVM args, AndroidX usage, and Kotlin code style.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Gradle wrapper configuration specifying distribution settings.",
  "frontend/android/settings.gradle": "Gradle settings defining plugin management, repositories, and project inclusion.",
  "frontend/docs/android-apk-build.md": "Documentation explaining prerequisites and steps for building the Android APK.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "HTML entry point loading the root element and main TypeScript module for the web app.",
  "frontend/scripts/build-android-apk-debug.ps1": "Builds the React app and Android debug APK on Windows, verifies APK integrity, and copies it to public assets.",
  "frontend/scripts/build-android-apk-debug.sh": "Builds the React app and Android debug APK on Linux/macOS, validates the APK, copies it to assets, and generates metadata.",
  "frontend/scripts/stage-android-apk-assets.ps1": "Stages the Android APK on Windows by validating or building it, then verifies final APK and metadata.",
  "frontend/scripts/stage-android-apk-assets.sh": "Stages the Android APK on Linux/macOS, rebuilding if needed and validating the final APK and metadata.",
  "frontend/src/App.tsx": "Defines the main app router and root component, handling authentication, PIN and biometric flows, and global layout providers.",
  "frontend/src/components/admin/TermsManagementPanel.tsx": "Admin panel for viewing, editing, and publishing legal documents including terms and privacy policy.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied screen, detects admin-only routes, logs denial info, and provides navigation and logout actions.",
  "frontend/src/components/auth/BiometricEnablementDialog.tsx": "Dialog for enabling biometric authentication with feedback, allowing users to enable or skip setup.",
  "frontend/src/components/auth/FactoryResetDialog.tsx": "Confirmation dialog for factory resetting the app, validating a required phrase and displaying errors.",
  "frontend/src/components/auth/PinSetupDialog.tsx": "Guides users through creating and confirming a 4‑digit PIN, handling validation and saving the PIN.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Collects user profile details, handles role selection logic (including Super Admin bootstrapping), and submits profile data with validation.",
  "frontend/src/components/auth/UnlockDialog.tsx": "Unlock dialog that attempts biometric authentication first, then falls back to PIN verification with error handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with role‑based navigation, language selection, theme toggle, and logout handling.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Manages light/dark/system theme state, syncing it to DOM classes and local storage.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button component that switches between light and dark themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAndroidAuthBridge.ts": "Detects Android WebView context and wraps Internet Identity login with Android‑specific error handling.",
  "frontend/src/hooks/useBiometricAuth.ts": "Handles enabling and verifying WebAuthn-based biometric authentication with local storage tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useLocalPin.ts": "Implements a local PIN system with hashed storage, unlock state, and reactive session management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping actor API calls for profiles, admin bootstrap, terms, and system reset with cache invalidation.",
  "frontend/src/i18n/LanguageProvider.tsx": "Provides language context with English/French translations, persistent language state, and a key-based translation function.",
  "frontend/src/i18n/translations/en.ts": "English translation dictionary containing UI strings for common labels, roles, navigation, and app screens.",
  "frontend/src/i18n/translations/fr.ts": "French translation dictionary mirroring the English keys with localized UI strings.",
  "frontend/src/index.css": "Tailwind CSS base setup defining light and dark theme color variables and applying global styles.",
  "frontend/src/legal/providedLegalText.ts": "Contains static customer and store‑owner legal documents for PrimePost as multi-line text constants.",
  "frontend/src/main.tsx": "Entry point that initializes React, sets up QueryClient and InternetIdentityProvider, and renders the App component.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Renders the admin dashboard showing store, customer, order, and revenue stats with store block/unblock controls and analytics tabs.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Displays admin settings with a panel for managing terms and policies using language‑aware labels.",
  "frontend/src/pages/auth/RoleLoginPage.tsx": "Handles role-based login, super admin bootstrap/reset, and factory reset flows with Internet Identity and Android auth support.",
  "frontend/src/pages/customer/CartPage.tsx": "Shows the customer’s cart grouped by store with quantity controls, totals, and navigation to store pages or checkout.",
  "frontend/src/pages/customer/CheckoutPage.tsx": "Processes checkout for a store’s items with table number, notes, payment selection, PIN/biometric confirmation, and order submission.",
  "frontend/src/pages/customer/CustomerDashboard.tsx": "Provides quick‑action navigation tiles for customers to access stores, marketplace, cart, and orders.",
  "frontend/src/pages/customer/CustomerSettingsPage.tsx": "Displays and updates the customer’s profile information using language‑based labels and validation.",
  "frontend/src/pages/customer/MarketplacePage.tsx": "Marketplace UI that fetches products and stores, filters and sorts them, and allows adding items to cart.",
  "frontend/src/pages/customer/OrderDetailPage.tsx": "Displays details for a specific customer order, including items, status, store info, and metadata.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Shows active and completed customer orders in tabbed lists with navigation to order details.",
  "frontend/src/pages/customer/StoreAccessPage.tsx": "Simple form allowing users to enter a store ID and navigate to its detail page.",
  "frontend/src/pages/customer/StoreDetailPage.tsx": "Displays store info, products, reviews, and lets users add items to their cart.",
  "frontend/src/pages/customer/StoreSearchPage.tsx": "Store search page that filters stores by name and category and links to store detail pages.",
  "frontend/src/pages/owner/InventoryPage.tsx": "UI for listing, creating, editing, and deleting store products with image upload and stock handling.",
  "frontend/src/pages/owner/OrdersManagementPage.tsx": "Displays store orders grouped by status and allows updating order status.",
  "frontend/src/pages/owner/OwnerDashboard.tsx": "Shows all stores owned by the user and links to inventory, orders, and settings pages.",
  "frontend/src/pages/owner/OwnerSettingsPage.tsx": "Lets the owner view and update their profile information including name, phone, and email.",
  "frontend/src/pages/owner/StoreRegistrationPage.tsx": "Form for creating a new store with name, category, location, and mobile money details.",
  "frontend/src/pages/owner/StoreSettingsPage.tsx": "Allows editing an existing store’s details such as name, category, location, and mobile money number.",
  "frontend/src/pages/public/ApkDownloadPage.tsx": "Displays APK download info, fetches metadata and validation results, and shows errors if the deployed APK is invalid.",
  "frontend/src/pages/terms/PrivacyPolicyPage.tsx": "Loads and displays the privacy policy content with fallback error handling and a back button.",
  "frontend/src/pages/terms/TermsAcceptancePage.tsx": "Shows customer or owner terms, tracks acceptance, falls back to bundled text, and submits acceptance before redirecting.",
  "frontend/src/state/cartStore.ts": "Zustand store managing per‑store cart items with persistence, quantity updates, totals, and clearing functions.",
  "frontend/src/state/pinSessionStore.ts": "In‑memory store tracking PIN setup and unlock state with subscription support.",
  "frontend/src/utils/analytics.ts": "Aggregates order data into daily, weekly, and monthly stats with revenue calculations.",
  "frontend/src/utils/apkIntegrity.ts": "Fetches APK metadata and validates the deployed APK's header, size, and content type for integrity checks.",
  "frontend/src/utils/geolocation.ts": "Provides geolocation retrieval, distance calculation, and parsing of coordinate strings.",
  "frontend/src/utils/logout.ts": "Implements logout and factory-reset cleanup logic, clearing identity, caches, storage, and navigating home while tracking a logout epoch.",
  "frontend/src/utils/money.ts": "Provides helpers for formatting prices and computing effective and line-item totals using bigint values.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/userProfile.ts": "Generates a display name and initials from a UserProfile object with fallbacks.",
  "frontend/src/utils/webauthn.ts": "Wraps WebAuthn availability checks and credential creation/authentication with error handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layout, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing current state, known issues, and a feature ensuring proper LanguageProvider usage."
}