{
  "backend/main.mo": "Backend canister defining user profiles, roles, terms, stores, products, orders, reviews, and authorization helpers using Map/List-based state.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, related frontend files, components, and test mappings for recent app changes.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing their functionality, routing, UI behavior, and terms-handling logic.",
  "frontend/android/.gitignore": "Gitignore rules for Android build artifacts, IDE files, keystores, and generated assets.",
  "frontend/android/app/build.gradle": "Android app Gradle config defining SDK versions, dependencies, build types, and a task to copy web assets into the APK.",
  "frontend/android/app/src/main/AndroidManifest.xml": "Android manifest defining app permissions, main activity, launcher intent, and deep link handling for auth return.",
  "frontend/android/app/src/main/assets/www/.keep": "Placeholder file ensuring the assets directory is preserved in version control.",
  "frontend/android/app/src/main/java/com/primepost/app/MainActivity.kt": "Main Android activity hosting the WebView, handling auth deep links, injecting flags, and routing external identity URLs via Custom Tabs.",
  "frontend/android/app/src/main/java/com/primepost/app/WebViewAuthNavigator.kt": "Utility for detecting identity provider URLs, handling return deep links, and opening external auth flows in Custom Tabs.",
  "frontend/android/app/src/main/res/drawable/splash_screen.xml": "Splash screen layer list showing a white background and centered launcher icon.",
  "frontend/android/app/src/main/res/layout/activity_main.xml": "Layout containing a full-screen WebView used to load the web application.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher_round.xml": "Round adaptive launcher icon configuration referencing the same foreground asset.",
  "frontend/android/app/src/main/res/mipmap-anydpi-v26/ic_launcher.xml": "Adaptive launcher icon configuration with white background and foreground asset.",
  "frontend/android/app/src/main/res/values/strings.xml": "App string resources defining the application name.",
  "frontend/android/app/src/main/res/values/themes.xml": "App theme configuring splash screen background and no-action-bar layout.",
  "frontend/android/build.gradle": "Project-level Gradle config defining plugins, repositories, and a clean task.",
  "frontend/android/gradle.properties": "Gradle properties including JVM args, AndroidX usage, and Kotlin style settings.",
  "frontend/android/gradle/wrapper/gradle-wrapper.properties": "Gradle wrapper configuration specifying distribution source for Gradle 8.2.",
  "frontend/android/settings.gradle": "Gradle settings defining repositories and including the Android app module.",
  "frontend/docs/android-apk-build.md": "Guide describing prerequisites and steps for building the PrimePost Android APK.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx.",
  "frontend/scripts/build-android-apk-debug.ps1": "PowerShell script that builds the web app and generates a debug Android APK on Windows.",
  "frontend/scripts/build-android-apk-debug.sh": "Shell script that builds the web app and generates a debug Android APK on Unix systems.",
  "frontend/src/App.tsx": "Main app router and root component managing routes, authentication state, and setup dialogs.",
  "frontend/src/components/admin/TermsManagementPanel.tsx": "Admin panel for viewing, editing, and publishing customer, owner, and privacy policy documents.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI screen informing users they lack permission and offering navigation back home.",
  "frontend/src/components/auth/BiometricEnablementDialog.tsx": "Dialog allowing users to enable biometric authentication with success and error handling.",
  "frontend/src/components/auth/PinSetupDialog.tsx": "Dialog guiding users through creating and confirming a 4‑digit PIN.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for filling out user profile details, selecting a role, and optionally accepting terms.",
  "frontend/src/components/auth/UnlockDialog.tsx": "Biometric and PIN-based unlock dialog that manages authentication flow and errors.",
  "frontend/src/components/layout/AppLayout.tsx": "Application layout with role-based navigation, header, footer, and logout handling.",
  "frontend/src/components/theme/ThemeProvider.tsx": "Theme context provider managing light, dark, and system modes with persistence.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button component that toggles between light and dark themes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor, refreshing it when identity changes.",
  "frontend/src/hooks/useAndroidAuthBridge.ts": "Detects Android WebView and wraps Internet Identity login with Android-specific error handling.",
  "frontend/src/hooks/useBiometricAuth.ts": "Manages enabling and verifying WebAuthn biometric authentication with local storage state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity context and provider handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/useLocalPin.ts": "Manages PIN storage and unlock state using localStorage, sessionStorage, and a reactive store with functions to set, verify, lock, and unlock the session.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend operations like fetching and updating profiles, terms content, and admin actions, wired through an actor interface.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme CSS variables for colors, layout, and component styling.",
  "frontend/src/legal/providedLegalText.ts": "Contains static customer and store owner legal documents as multi-line text strings for display in the app.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing store, customer, and order metrics with analytics views and controls to block or unblock stores.",
  "frontend/src/pages/auth/RoleLoginPage.tsx": "Role-based login screen using Internet Identity and Android auth bridging, redirecting users to dashboards based on their role and profile.",
  "frontend/src/pages/customer/CartPage.tsx": "Renders the shopping cart, allowing quantity updates, item removal, and navigation to stores or checkout.",
  "frontend/src/pages/customer/CheckoutPage.tsx": "Handles checkout flow including table info, payment selection, biometric or PIN auth, and order submission.",
  "frontend/src/pages/customer/CustomerDashboard.tsx": "Displays dashboard actions for navigating to store access, search, marketplace, cart, and orders.",
  "frontend/src/pages/customer/MarketplacePage.tsx": "Shows marketplace products with search, category filtering, sorting, and add‑to‑cart functionality.",
  "frontend/src/pages/customer/OrderDetailPage.tsx": "Displays detailed info for a specific order including items, status, table number, and notes.",
  "frontend/src/pages/customer/OrdersPage.tsx": "Lists active and completed orders with status badges and navigation to order details.",
  "frontend/src/pages/customer/StoreAccessPage.tsx": "Provides a form to enter a store ID and navigate to that store’s product page.",
  "frontend/src/pages/customer/StoreDetailPage.tsx": "Displays store details, reviews, and product list, allowing users to add items to the cart and navigate to the cart page.",
  "frontend/src/pages/customer/StoreSearchPage.tsx": "Provides search and filtering UI for finding stores by name or category and navigating to store detail pages.",
  "frontend/src/pages/owner/InventoryPage.tsx": "Allows store owners to view, create, edit, and delete products with image uploads and stock management.",
  "frontend/src/pages/owner/OrdersManagementPage.tsx": "Enables store owners to view orders by status and update each order’s progress through acceptance and completion actions.",
  "frontend/src/pages/owner/OwnerDashboard.tsx": "Lists the owner's stores with navigation to inventory, orders, and settings, and offers store registration.",
  "frontend/src/pages/owner/StoreRegistrationPage.tsx": "Form page for creating a new store with fields for name, category, location, and mobile money number.",
  "frontend/src/pages/owner/StoreSettingsPage.tsx": "Store settings form allowing owners to view and update store details using query hooks and navigation.",
  "frontend/src/pages/public/ApkDownloadPage.tsx": "Public page offering an APK download link with installation steps and a return-to-home button.",
  "frontend/src/pages/terms/PrivacyPolicyPage.tsx": "Loads and displays the privacy policy content with fallback messaging and a home navigation button.",
  "frontend/src/pages/terms/TermsAcceptancePage.tsx": "Displays customer or owner terms, requires acceptance, and records acceptance before redirecting.",
  "frontend/src/state/cartStore.ts": "Zustand store managing per‑store shopping carts with add, remove, update, clear, and total‑calculation logic.",
  "frontend/src/state/pinSessionStore.ts": "In‑tab reactive store tracking whether a PIN is set and whether the session is unlocked.",
  "frontend/src/utils/analytics.ts": "Utility functions aggregating orders into daily, weekly, and monthly revenue and count statistics.",
  "frontend/src/utils/money.ts": "Money helpers for formatting prices and computing discounted or line‑total amounts.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL and hash parameters, persisting them in sessionStorage, and clearing stored or hash-based params.",
  "frontend/src/utils/userProfile.ts": "Provides display name and initials extraction from a UserProfile object with fallbacks.",
  "frontend/src/utils/webauthn.ts": "WebAuthn utilities for checking availability and creating or retrieving platform credentials with proper error handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Project metadata capturing requirements, architecture notes, known issues, and existing features for PrimePost."
}