{
  "kind": "build_request",
  "title": "Bypass Terms for Admin, ensure Terms availability, and expose public APK download with 3-role login landing",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-41",
      "text": "Update the first-time profile onboarding (ProfileSetupDialog) so that selecting the Admin (Super Admin) role does NOT require accepting Terms & Conditions and does NOT show a Terms acceptance checkbox for Admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Armin don't need terms and conditions."
        ]
      },
      "acceptanceCriteria": [
        "When the user selects the Admin role during profile setup, the UI does not show a Terms & Conditions acceptance checkbox and does not block profile creation due to Terms not being accepted.",
        "When the user selects Customer or Store Owner roles during profile setup, the Terms & Conditions acceptance checkbox is still required before continuing.",
        "All user-facing text for validation/errors remains in English."
      ]
    },
    {
      "id": "REQ-42",
      "text": "Ensure Super Admin users are never routed to TermsAcceptancePage and are never blocked by Terms availability/acceptance checks anywhere in the admin login + navigation flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "To login as admin, where the terms and conditions is saying that it's not available."
        ]
      },
      "acceptanceCriteria": [
        "Logging in via the Admin login option always navigates to the Admin dashboard for authenticated users with role Super Admin, without redirecting to any /terms/* routes.",
        "If a Super Admin user has no acceptedCustomerTerms/acceptedStoreOwnerTerms flags (false), the Admin area is still accessible and unaffected."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Ensure Customer and Store Owner Terms screens never block users with a “Terms and Conditions are not yet available” state; when backend terms content is missing, render the provided fallback legal text and allow acceptance to proceed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "terms and conditions is saying that it's not available"
        ]
      },
      "acceptanceCriteria": [
        "On /terms/customer and /terms/owner, if the backend returns null/empty for terms content, the page displays fallback terms text and the 'Accept and Continue' action can be completed.",
        "The TermsAcceptancePage does not show a blocking message stating that terms are unavailable in the fallback case."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Add (or verify and wire up) a public, no-login-required APK download page route in the React app, and link to it from the landing experience so users can download the APK without developer instructions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Please also make the APK downloadable"
        ]
      },
      "acceptanceCriteria": [
        "A public route exists that does not require authentication and includes: (1) a direct download link to the APK file and (2) short install instructions in English.",
        "The app landing (home) experience includes an obvious link/button to open the APK download page.",
        "The APK download link points to a stable filename under frontend static public assets (so the link does not change between builds)."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Update the landing screen copy so the three login options are explicitly: Customer, Store, Admin (matching the user’s requested wording), while keeping role routing behavior unchanged (Customer -> /login/customer, Store -> /login/owner, Admin -> /login/admin).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "one app has 3 login options. Option 1 is to login as customer, option is to login as store , and option 3 is to login as admin"
        ]
      },
      "acceptanceCriteria": [
        "The home screen shows exactly three primary login actions labeled in English: 'Customer', 'Store', and 'Admin'.",
        "Tapping each option routes to the correct existing role login page and then into the correct dashboard based on the user profile role."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Backend must remain a single Motoko actor in backend/main.mo; add migration.mo only if a state upgrade is required.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing new authentication providers beyond Internet Identity.",
    "Changing role definitions or adding additional roles beyond Customer, Store Owner/Worker, and Super Admin.",
    "Producing a signed release APK (this request is limited to making an APK downloadable via the web app with a stable filename)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}