{
  "kind": "build_request",
  "title": "Add PrimePost Privacy Policy and publish provided Terms & Conditions text",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Extend the backend legal-documents storage to support a Privacy Policy document in addition to existing Customer Terms and Store Owner Terms, with read access for all users and write access restricted to Super Admins.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please put the terms and conditions and privacy policy. Here there are."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method to fetch Privacy Policy content without requiring a Super Admin role.",
        "Backend exposes a shared method to save/update Privacy Policy content that traps when caller is not a Super Admin.",
        "Existing Terms & Conditions APIs (getTermsContent/saveTermsContent/acceptTerms/hasAcceptedTerms) continue to work unchanged."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Publish the user-provided legal text in the app by setting the stored content for (1) Customer Terms & Conditions, (2) Store Owner / Service Provider Terms & Conditions, and (3) Privacy Policy exactly as provided by the user, with the placeholder token \"[App Name]\" replaced with \"PrimePost\" wherever it appears.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "App name: PrimePost",
          "📄 CUSTOMER TERMS AND CONDITIONS",
          "📄 STORE OWNER / SERVICE PROVIDER TERMS AND CONDITIONS",
          "📄 PRIVACY POLICY"
        ]
      },
      "acceptanceCriteria": [
        "Customer Terms content shown in the app matches the provided text, including \"Effective Date: 15 April 2026\" and \"Platform: PrimePost\", and does not contain \"[App Name]\".",
        "Store Owner / Service Provider Terms content shown in the app matches the provided text and does not contain \"[App Name]\" (leave \"Effective Date: [Insert Date]\" as-is unless the user supplies a date).",
        "Privacy Policy content shown in the app matches the provided text, including \"Operated by: WeMove All\", \"Country: Cameroon\", and \"PrimePost7@gmail.com\".",
        "If the canister already has existing legal content in stable state, the upgrade path preserves existing content unless it is empty/unset (use conditional migration policy if schema changes are required)."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add a user-facing Privacy Policy screen in the frontend that renders the stored Privacy Policy text with the same readability/scrolling treatment used by the existing TermsAcceptancePage, and make it reachable from all roles (Customer, Store Owner/Worker, Super Admin) via an in-app navigation entry or footer link labeled \"Privacy Policy\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Also add privacy policy. Here they are 📄 PRIVACY POLICY"
        ]
      },
      "acceptanceCriteria": [
        "A new route exists that displays the Privacy Policy content in a scrollable container with preserved whitespace (similar to terms display).",
        "The Privacy Policy screen handles the \"content missing\" state with a clear English error message.",
        "Users can navigate to the Privacy Policy screen from within the app UI regardless of role (customer/owner/admin)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Update the Super Admin dashboard legal-documents management UI to include a Privacy Policy editor (view/edit/save) alongside the existing Customer Terms and Store Owner Terms editors.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Please put the terms and conditions and privacy policy. Here there are."
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard includes a visible section/tab to manage \"Privacy Policy\" content.",
        "Privacy Policy editor supports loading current content, editing in a textarea, and saving updates with success/error toasts.",
        "Saving Privacy Policy invalidates/refetches the relevant React Query cache so the latest content appears immediately after save."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend logic there.",
    "Create backend/migration.mo only if required by stable-state changes (conditional migration policy).",
    "Do not edit files under frontend/src/components/ui (read-only UI components must be composed, not modified).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not add third-party legal document hosting or external CMS integrations.",
    "Do not implement mandatory Privacy Policy acceptance gating unless explicitly requested by the user.",
    "Do not change existing role-based access control behavior beyond what is required to view/edit legal documents."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}