{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "PrimePost frontend plan: role-based mobile POS/marketplace, bilingual UI, gated onboarding, profile/settings, discovery, checkout, tracking, admin",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show exactly three role login entry points (Customer/Store Owner/Super Admin) and ensure role-guarded routes show access denied when mismatched.",
      "acceptanceCriteria": [
        "The public home screen shows exactly three primary actions to start login: Customer, Store Owner, Super Admin.",
        "No other roles (e.g., staff/cashier) appear in navigation, auth screens, or profile setup.",
        "Attempting to access role routes directly without the matching role continues to show an access-denied experience."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the public home screen presents exactly three login actions with labels matching the requirement (Customer, Store Owner, Super Admin), and confirm only the three role login routes exist/are wired. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/auth/RoleLoginPage.tsx",
          "operation": "modify",
          "description": "Persist the chosen role intent when starting a login (e.g., in sessionStorage) so onboarding cannot switch roles, and ensure role mismatch messaging stays within the three defined roles only. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Remove any UI that allows selecting arbitrary roles during profile setup; instead, infer the role from the selected login entry point (stored role intent) and prevent showing any other login types/roles. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Keep an access-denied experience for direct route access without the matching role, and ensure copy/CTA only references the three allowed roles. Use the authorization component’s role-based access expectations as the guiding model for UI guards. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add full English/French i18n with a persistent in-app language switch in Settings/Profile and apply translations across customer/owner/admin screens.",
      "acceptanceCriteria": [
        "A language selector is available to signed-in users in a settings/profile area (Customer and Store Owner at minimum; Admin may reuse the same setting).",
        "Switching language immediately updates UI strings without requiring logout.",
        "Language choice persists across reloads within the same device/browser context.",
        "Core flows (login, profile setup, store browsing, cart/checkout, orders, owner inventory/orders, admin dashboard) have translated strings for both languages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/i18n/i18n.ts",
          "operation": "create",
          "description": "Create i18n utilities (language state, persistence, and a translation function) supporting English/French with immediate updates via context/provider. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/i18n/translations/en.ts",
          "operation": "create",
          "description": "Add English translation dictionary covering core flows and shared UI strings. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/i18n/translations/fr.ts",
          "operation": "create",
          "description": "Add French translation dictionary covering core flows and shared UI strings. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/i18n/LanguageProvider.tsx",
          "operation": "create",
          "description": "Add a LanguageProvider (React context) that exposes current language, setter, and t() for translated strings; persist language in localStorage. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Wrap the app with LanguageProvider so all screens can access translations and language switching. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Replace hard-coded navigation labels with translated strings and ensure layout remains mobile-first in both languages. Use shadcn-ui composed components where already used. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/auth/RoleLoginPage.tsx",
          "operation": "modify",
          "description": "Replace hard-coded login strings with i18n translations and ensure role labels match requirement in both languages. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Translate onboarding/profile setup UI and validation messaging; ensure language changes reflect immediately while dialog is open. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Translate checkout UI, payment method labels, and validation errors so they display in the active language. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/StoreSearchPage.tsx",
          "operation": "modify",
          "description": "Translate store search/discovery UI and empty/loading states for bilingual consistency. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/MarketplacePage.tsx",
          "operation": "modify",
          "description": "Translate marketplace UI, filters, and empty/loading states. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/OrdersPage.tsx",
          "operation": "modify",
          "description": "Translate order list labels and status text rendering. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Translate key admin dashboard labels, sections, and actions. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Display the assigned read-only 5-digit sequential user ID in user profiles for Customers and Store Owners and prevent any UI edit of that value.",
      "acceptanceCriteria": [
        "When a new Customer or Store Owner profile is created, the backend assigns the next available 5-digit ID and persists it.",
        "IDs are strictly sequential with left-zero padding to 5 digits (e.g., 00001).",
        "The assigned ID is returned as part of the user profile data and rendered in the profile screen.",
        "The UI provides no form input to edit the ID, and backend rejects any attempt to change it via profile updates.",
        "No two users can receive the same ID, even under concurrent registrations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/customer/CustomerSettingsPage.tsx",
          "operation": "create",
          "description": "Create a customer settings/profile page that renders userId as read-only (no input) and displays it prominently (e.g., 'PrimePost ID'). Use shadcn-ui form components already in the project. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/owner/OwnerSettingsPage.tsx",
          "operation": "create",
          "description": "Create a store owner settings/profile page that renders userId as read-only (no input) and displays it prominently. Use shadcn-ui form components already in the project. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/adjust profile update mutations usage so they never attempt to send userId modifications from the UI (treat userId as immutable on the client). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new settings routes into the router under /customer and /owner, ensuring they are reachable from authenticated areas. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add navigation entry to Settings/Profile for Customer and Store Owner (and optionally Admin) without introducing any new login role options. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Require explicit acceptance of both Terms & Conditions and Privacy Policy during Customer/Store Owner account creation, with Super Admin excluded.",
      "acceptanceCriteria": [
        "During profile/account creation for Customer and Store Owner, the UI requires explicit acceptance of both Terms & Conditions and Privacy Policy before enabling submission.",
        "Super Admin bootstrap/profile creation flow does not require these checkboxes.",
        "Backend stores acceptance status for each user and uses it to gate protected actions that require terms acceptance (e.g., placing orders for customers; creating/updating stores/products and updating order statuses for store owners).",
        "Privacy Policy acceptance is supported as an accept-able document type (not rejected as “not applicable”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/ProfileSetupDialog.tsx",
          "operation": "modify",
          "description": "Replace the single terms checkbox with two mandatory checkboxes (Terms & Conditions + Privacy Policy) for Customer/Store Owner only; keep Super Admin path excluded. Link to the existing terms/privacy pages and keep submission disabled until both are checked. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/terms/TermsAcceptancePage.tsx",
          "operation": "modify",
          "description": "Ensure Terms acceptance page copy/controls are translated and compatible with the onboarding gating, and that acceptance refreshes relevant cached queries. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/terms/PrivacyPolicyPage.tsx",
          "operation": "modify",
          "description": "Ensure privacy policy page is accessible from onboarding and translated; keep navigation back consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update terms acceptance/query invalidation patterns so accepting customer/store-owner terms and privacy policy can be reflected immediately in UI gating decisions. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm gating logic routes Customer/Owner to appropriate terms acceptance flows and does not gate Super Admin; ensure privacy policy remains accessible from footer. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add PIN security UX for customers/owners: require PIN setup at first registration, require PIN unlock for sessions, and enable PIN change from settings.",
      "acceptanceCriteria": [
        "Customer and Store Owner onboarding requires setting a 4-digit PIN (with confirmation) before granting access to role dashboards.",
        "The backend persists only a hashed PIN representation (no plaintext storage).",
        "Subsequent sessions require PIN verification to unlock access to authenticated areas (or equivalent session lock behavior).",
        "A user can change their PIN from profile/settings after verifying their current PIN.",
        "PIN change updates the stored hash and invalidates any existing local/session unlock state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/PinSetupDialog.tsx",
          "operation": "modify",
          "description": "Ensure the PIN setup dialog is enforced specifically for Customer/Store Owner after profile creation and uses i18n strings; keep validations (4 digits + confirm) consistent. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/UnlockDialog.tsx",
          "operation": "modify",
          "description": "Ensure unlock dialog copy is translated and the unlock experience is required for returning sessions in authenticated areas. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useLocalPin.ts",
          "operation": "modify",
          "description": "Add a 'change PIN' helper flow support (verify current PIN, set new PIN, and clear unlock state) to be used by settings pages; ensure any existing unlock state is invalidated on change. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/CustomerSettingsPage.tsx",
          "operation": "create",
          "description": "Add a 'Change PIN' section that verifies current PIN then prompts for new PIN and confirmation, reusing the local PIN utilities; ensure UI messages are translated. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/owner/OwnerSettingsPage.tsx",
          "operation": "create",
          "description": "Add a 'Change PIN' section mirroring the customer flow, using the same local PIN utilities and i18n strings. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Implement Super Admin first-login password setup and per-session admin unlock UX, including password change from admin settings.",
      "acceptanceCriteria": [
        "If a Super Admin does not yet have an admin password set, the first successful admin sign-in triggers a mandatory password setup screen before showing admin functionality.",
        "After the password is set, admin areas require password verification (at least once per session) to proceed.",
        "The backend stores only a hashed password (no plaintext).",
        "There is a clear flow to change the admin password from an admin settings area (requiring current password verification)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminSettingsPage.tsx",
          "operation": "create",
          "description": "Create an Admin Settings page containing (a) first-time password setup UI and (b) change-password UI requiring current password; translate all strings. This page should be reachable only for Super Admin. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new admin settings route under /admin and ensure it is reachable from admin navigation; add a guard so it only appears for Super Admin. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add an Admin Settings navigation entry for the admin role only, using translated labels. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/auth/RoleLoginPage.tsx",
          "operation": "modify",
          "description": "After successful Super Admin sign-in, direct the user into the forced password setup flow when required (client-side gating based on available backend state once present), before showing admin functionality. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Provide Customer/Store Owner profile management for phone/email/photo, PIN change, and language switch; keep userId read-only.",
      "acceptanceCriteria": [
        "A settings/profile screen exists for Customer and Store Owner with editable fields: phone number, email, and profile photo upload (optional).",
        "The unique 5-digit ID is displayed read-only and cannot be edited.",
        "Profile changes persist after reload and are reflected in subsequent profile reads.",
        "PIN change is accessible from the same settings/profile area (reusing the secure flow from REQ-5).",
        "Language switch is accessible from the same settings/profile area (reusing REQ-2)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/customer/CustomerSettingsPage.tsx",
          "operation": "create",
          "description": "Implement customer profile editing UI for phone/email (and optional photo picker), display read-only userId, include language selector, and include change PIN entry point. For photos, use the blob-storage ExternalBlob type for upload/display once backend profile supports it. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/owner/OwnerSettingsPage.tsx",
          "operation": "create",
          "description": "Implement store owner profile editing UI for phone/email (and optional photo picker), display read-only userId, include language selector, and include change PIN entry point. For photos, use the blob-storage ExternalBlob type for upload/display once backend profile supports it. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a dedicated 'update my profile' helper (built atop saveCallerUserProfile) to update only editable fields while preserving role/userId and other server-managed fields, and ensure queries invalidate correctly after save. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add Settings/Profile navigation for customer and owner roles and ensure it does not expose any new roles or login types. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add and wire /customer/settings and /owner/settings routes into the router tree and ensure they render inside AppLayout. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add customer store discovery via Store ID, name search, category filter, and “near me” geolocation filtering/sorting with graceful denial handling.",
      "acceptanceCriteria": [
        "Customer can navigate to a screen to enter a Store ID and open that store if it exists.",
        "Store search supports name search and category filtering.",
        "A “Near me” option requests geolocation permission and, when granted, sorts/filters stores by proximity using the store’s location field (or coordinates if available).",
        "If geolocation permission is denied/unavailable, the UI shows a clear message and continues to allow name/category search."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/customer/StoreSearchPage.tsx",
          "operation": "modify",
          "description": "Add a 'Near me' toggle/action that requests geolocation permission, then sorts/filters stores by proximity when possible; if unavailable/denied, show a translated message and keep name/category search usable. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/geolocation.ts",
          "operation": "create",
          "description": "Add a small geolocation utility (permission request, coordinate retrieval, and distance calculation) to support near-me sorting/filtering without any third-party map provider. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/StoreAccessPage.tsx",
          "operation": "modify",
          "description": "Translate and polish Store ID access UX and errors so it remains functional alongside the new discovery options. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Ensure checkout supports basket review, optional table number, special instructions, cash/mobile money selection, and shows store mobile money number when applicable.",
      "acceptanceCriteria": [
        "Checkout UI includes fields for table number (optional), special instructions (optional), and payment method (Cash/Mobile Money).",
        "If Mobile Money is selected, the store’s Mobile Money number is displayed prominently on the checkout screen prior to placing the order.",
        "Orders created from checkout include the selected payment method and any provided table number/notes.",
        "Validation errors are shown in the active language (English/French)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/customer/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Ensure mobile money selection prominently displays the store’s registered mobile money number before confirming; translate labels/errors; and add validation messaging in the active language. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/CartPage.tsx",
          "operation": "modify",
          "description": "Translate cart UI and ensure navigation into checkout maintains the correct store context for basket review. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add order tracking statuses with near-real-time updates (polling) and in-app notifications/toasts on status changes for customers and owners; enforce owner status progression mapping in UI.",
      "acceptanceCriteria": [
        "Customer order lists/details display one of the four statuses with consistent labeling.",
        "Store Owner order management UI can progress orders through the required statuses in the required mapping: item picking/ticking => In Progress; clicking “Completed” in owner flow sets customer-visible status to On The Way; a final action sets status to Completed.",
        "Customer screens update status changes without requiring a manual refresh (e.g., via polling/refetch intervals while the app is open).",
        "When an order status changes while the customer/owner is actively in the app, an in-app notification/toast is shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add polling (refetchInterval) for customer order queries (and keep owner polling) to achieve near-real-time updates while the app is open; ensure intervals are reasonable for mobile. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useOrderStatusNotifications.ts",
          "operation": "create",
          "description": "Create a hook that watches order lists (customer and owner views), compares previous vs current statuses, and emits an in-app toast when a status changes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/OrdersPage.tsx",
          "operation": "modify",
          "description": "Use the status notification hook and ensure status labels are consistently rendered and translated. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/OrderDetailPage.tsx",
          "operation": "modify",
          "description": "Ensure order detail shows translated, consistent status labels and reacts to polling updates; show an in-app toast when the viewed order status changes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/owner/OrdersManagementPage.tsx",
          "operation": "modify",
          "description": "Implement/adjust the owner UI so item ticking triggers moving to In Progress; the owner 'Completed' action maps to customer-visible On The Way; add a final 'Complete' action to set Completed; show translated in-app toasts on updates. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Support store owner store registration and store details management in the UI, and reflect blocked-store behavior in customer ordering UX.",
      "acceptanceCriteria": [
        "Store Owner can create a store with name, category, location, and Mobile Money number.",
        "Store Owner can edit their store details and the changes persist.",
        "Non-owners cannot update the store and receive an access-denied error.",
        "If a store is blocked by Admin, customers cannot place orders to that store and the UI reflects the blocked state appropriately."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/owner/StoreRegistrationPage.tsx",
          "operation": "modify",
          "description": "Translate and validate store registration fields (name/category/location/mobile money) and ensure mobile-first form layout. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/owner/StoreSettingsPage.tsx",
          "operation": "modify",
          "description": "Translate store settings UI and handle authorization failures gracefully by surfacing an access-denied message (consistent with the authorization component’s expectations). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/StoreDetailPage.tsx",
          "operation": "modify",
          "description": "If a store is blocked, render a clear translated blocked-state banner and disable add-to-cart/checkout actions accordingly. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Prevent order confirmation when the store is blocked and display a translated message explaining the store cannot accept orders. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Support owner product management UX: add/edit/delete, image upload, price/stock controls, out-of-stock toggle, and low-stock alerts in the UI.",
      "acceptanceCriteria": [
        "Owner can create, edit, and delete products for their store.",
        "Product creation/edit supports image upload, price, and stock quantity.",
        "Products can be marked out of stock and appear as unavailable to customers.",
        "Owner UI highlights low-stock products (define a configurable threshold in UI, or a sensible default) and shows an alert indicator while the app is open."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/owner/InventoryPage.tsx",
          "operation": "modify",
          "description": "Ensure inventory UI includes out-of-stock toggle, stock quantity editing, and low-stock highlighting with a sensible default threshold (optionally user-adjustable in UI); translate all labels. Use blob-storage ExternalBlob for product image upload/display. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/StoreDetailPage.tsx",
          "operation": "modify",
          "description": "Ensure out-of-stock products appear unavailable to customers (disabled add-to-cart, clear labeling) and translate related labels/errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useLowStockAlerts.ts",
          "operation": "create",
          "description": "Create a lightweight hook for owner inventory that detects low-stock products (from queried products) and shows an in-app alert/toast while the app is open. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Implement marketplace UX for promotional/discounted items, including customer browsing/search and “near me” sorting/filtering.",
      "acceptanceCriteria": [
        "Owner can mark a product as a marketplace/promotional item and optionally set a discount value.",
        "Customer Marketplace page lists marketplace/promotional items and supports search by item name.",
        "Customer Marketplace supports a “near me” filter/sort using device geolocation when available.",
        "Discounted items are visually distinguished from non-discounted items (e.g., showing original vs discounted price)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/owner/InventoryPage.tsx",
          "operation": "modify",
          "description": "Ensure owner can mark products as marketplace/promotional and set an optional discount value; translate UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/MarketplacePage.tsx",
          "operation": "modify",
          "description": "Add a 'Near me' filter/sort using the shared geolocation utility, and translate all marketplace UI; keep discounted items visually distinguished (original vs discounted price). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/geolocation.ts",
          "operation": "modify",
          "description": "Extend geolocation utilities as needed to support marketplace near-me behavior (shared with store search) and handle denied/unavailable permission gracefully. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Expand in-app Super Admin UI to manage customers/store owners, orders/transactions monitoring, suspensions/blocks, analytics summary, and system settings including legal docs.",
      "acceptanceCriteria": [
        "Admin dashboard provides lists of customers and store owners, with the ability to suspend/unsuspend users.",
        "Admin can block/unblock stores and blocked stores cannot accept new orders.",
        "Admin can view an orders/transactions list with basic details (store, customer, total, status, timestamp if available).",
        "Admin sees an analytics summary computed from order data (e.g., totals over time) and it updates as new orders are placed.",
        "Admin settings include terms/legal document management and any system-level configuration already supported by the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Ensure admin dashboard includes (a) customers list with suspend/unsuspend controls, (b) store list with block/unblock, (c) orders/transactions list, and (d) analytics summary that updates as new orders appear; translate key UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/TermsManagementPanel.tsx",
          "operation": "modify",
          "description": "Ensure terms/legal management UI is reachable from admin settings/dashboard and is fully translated; keep support for customer terms, store owner terms, and privacy policy. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminSettingsPage.tsx",
          "operation": "create",
          "description": "Add an Admin Settings page that houses system settings sections, including legal document management and admin password management UX. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add admin navigation entries for Settings and legal/system management while ensuring no new roles/login types are introduced. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Apply a cohesive, mobile-first PrimePost theme across all screens with consistent typography/spacing and light/dark parity.",
      "acceptanceCriteria": [
        "All primary pages share consistent header/navigation patterns and spacing suitable for phone screens.",
        "A single, coherent color system and typography scale is applied consistently (avoid introducing multiple competing styles).",
        "Light/dark mode remains readable and visually consistent after changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust/extend existing Tailwind/CSS variable tokens to reinforce a cohesive PrimePost mobile-first theme, ensuring readability in both light and dark modes without introducing competing styles. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Refine Tailwind theme extensions (spacing/typography/colors if needed) to keep a consistent design system across screens and support mobile-first layouts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Standardize header/nav spacing and main container padding for phone screens, ensuring consistent patterns across customer/owner/admin. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/customer/CustomerDashboard.tsx",
          "operation": "modify",
          "description": "Align dashboard styling with the global theme and ensure light/dark mode parity; translate visible strings via i18n. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/owner/OwnerDashboard.tsx",
          "operation": "modify",
          "description": "Align owner dashboard styling with the global theme and ensure light/dark mode parity; translate visible strings via i18n. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Align admin dashboard styling with the global theme and ensure light/dark mode parity; translate visible strings via i18n. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}