{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "PrimePost legal documents: publish provided Terms text and add Privacy Policy UI",
  "requirements": [
    {
      "id": "REQ-24",
      "summary": "Provide a frontend publishing path to set the exact user-provided Customer Terms, Store Owner Terms, and Privacy Policy text (with [App Name] replaced by PrimePost) using existing legal-document save capability.",
      "acceptanceCriteria": [
        "Customer Terms content shown in the app matches the provided text, including \"Effective Date: 15 April 2026\" and \"Platform: PrimePost\", and does not contain \"[App Name]\".",
        "Store Owner / Service Provider Terms content shown in the app matches the provided text and does not contain \"[App Name]\" (leave \"Effective Date: [Insert Date]\" as-is unless the user supplies a date).",
        "Privacy Policy content shown in the app matches the provided text, including \"Operated by: WeMove All\", \"Country: Cameroon\", and \"PrimePost7@gmail.com\".",
        "If the canister already has existing legal content in stable state, the upgrade path preserves existing content unless it is empty/unset (use conditional migration policy if schema changes are required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/legal/providedLegalText.ts",
          "operation": "create",
          "description": "Add exported constants for the three user-provided legal documents (Customer Terms, Store Owner Terms, Privacy Policy) with the placeholder token \"[App Name]\" replaced by \"PrimePost\" wherever it appears; keep the text exactly as provided otherwise."
        },
        {
          "path": "frontend/src/components/admin/TermsManagementPanel.tsx",
          "operation": "modify",
          "description": "Add an admin-only helper action (e.g., a button with a clear confirmation) that publishes the provided legal texts by calling the existing save capability for TermsType.customerTerms, TermsType.storeOwnerTerms, and TermsType.privacyPolicy using the constants from frontend/src/legal/providedLegalText.ts; show success/error toasts for the bulk publish operation."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Add a user-facing Privacy Policy screen that displays stored Privacy Policy text with the same scroll/readability treatment as the existing TermsAcceptancePage and is reachable from all roles via a \"Privacy Policy\" link.",
      "acceptanceCriteria": [
        "A new route exists that displays the Privacy Policy content in a scrollable container with preserved whitespace (similar to terms display).",
        "The Privacy Policy screen handles the \"content missing\" state with a clear English error message.",
        "Users can navigate to the Privacy Policy screen from within the app UI regardless of role (customer/owner/admin)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/terms/PrivacyPolicyPage.tsx",
          "operation": "create",
          "description": "Create a PrivacyPolicyPage that queries TermsType.privacyPolicy via the existing terms query hook and renders it in a scrollable container with whitespace preserved (matching TermsAcceptancePage treatment); include a clear English message when content is missing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new route (e.g., /privacy-policy) under the root router that renders the new PrivacyPolicyPage so it is accessible regardless of role."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Add a visible in-app navigation entry or footer link labeled \"Privacy Policy\" that navigates to the new privacy policy route for customer, owner, and admin layouts."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Extend the Super Admin legal-documents management UI to include a Privacy Policy editor (view/edit/save) alongside existing terms editors and ensure React Query cache is refreshed after save.",
      "acceptanceCriteria": [
        "Admin Dashboard includes a visible section/tab to manage \"Privacy Policy\" content.",
        "Privacy Policy editor supports loading current content, editing in a textarea, and saving updates with success/error toasts.",
        "Saving Privacy Policy invalidates/refetches the relevant React Query cache so the latest content appears immediately after save."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/TermsManagementPanel.tsx",
          "operation": "modify",
          "description": "Add a third tab/section for \"Privacy Policy\" that uses useGetTermsContent(TermsType.privacyPolicy) to load current content into a textarea and uses useSaveTermsContent to save updates; keep toast messaging in English and rely on the existing React Query invalidation in the save hook to refresh the displayed content immediately."
        }
      ]
    }
  ]
}